Sway-Light/sway-light-ht32f52352/main.c
	BFTM0_Configuration();
	
	ledInit();
	wsInit();
	wsBlinkAll(10);
	
	GPTM1_Configuration();
	TM_Configuration();
	I2C_Configuration();
	ADC_Configuration();
	
	initFlag = TRUE;
	ADC_Cmd(HT_ADC0, ENABLE);
	TM_Cmd(HT_GPTM0, ENABLE);
	TM_Cmd(HT_GPTM1, ENABLE);
	
	/* Analog Signal Setup */
	analogSwitcherSetup();
	asSetEnable(TRUE);
	asSetSignal(1);
	
	speakerEnable(TRUE);
	
	/* ESP8266 Setup */
	espUART_Configuration();
	DataToESP(0x01, 1); // Sending Power-On Message
	while(toEspFlag == TRUE);
	DataToESP(0x01, mode); // Sending Status Message
	while(toEspFlag == TRUE);
	DataToESP(0x02, 0x01); // Sending Initial Values of Brightness in Lighting Mode
	while(toEspFlag == TRUE);
	DataToESP(0x02, 0x03); // Sending Initial Values of Scale in Lighting Mode
	
	/* MP3 UART Setup */
	mp3UART_Configuration();
	mp3ResetModule(mp3CmdQueue, &queueSize);
	mp3SetDevice(mp3CmdQueue, &queueSize, 1); // SD Card
	delay(100000);
	mp3SetVolume(mp3CmdQueue, &queueSize, 20);
	mp3Play(mp3CmdQueue, &queueSize, 1);
	delay(100000);
	
	asSetSignal(0);
	
	while (1) {
		if (realTime_flag == TRUE && Timestamp != 0) {
			char buf[80];
			Timestamp += 1;
			
			ts = *localtime(&Timestamp);
			
			strftime(buf, sizeof(buf), "%a %Y-%m-%d %H:%M:%S %Z", &ts);
			printf("\r%s", buf);
			
			if (weekdayEN[ts.tm_wday - 1] == 1) {
				if (alarm.tm_hour == ts.tm_hour && alarm.tm_min == ts.tm_min && alarm.tm_sec == ts.tm_sec) {
					if (sync == 0x00) {
						mode = 0;
						wsBlinkAll(10);
						wsShow();
						speakerEnable(FALSE);
					} else {
						mode = 3;
						wsBlinkAll(10);
						wsShow();
						adcIndex = 0;
						speakerEnable(TRUE);
					}
//					printf("ALARM ON!\r\n");
				}
			}
			
			realTime_flag = FALSE;
		}
		if (espFlag) {
			u8 i;
			u16 sum = 0, checksum = 0;
			u32 time = 0;
			
			for (i = 1; i < 7; i++) sum += data_from_esp[i];
			checksum = (data_from_esp[7] << 8) + data_from_esp[8];

			printf("\r\n");
			if (!(data_from_esp[0] == 0x95)) {
				printf("start byte Error\r\n");
				errorFlag = TRUE;
			}
			if (checksum == sum) {
				
				if (data_from_esp[1] == 0x01) {
					printf("Switching Mode: \r\n");
					
					mode = data_from_esp[2];
					
					if (mode == 0) {
						
						asSetSignal(1);
						mp3SetVolume(mp3CmdQueue, &queueSize, 20);
						mp3Play(mp3CmdQueue, &queueSize, 2);
						delay(10000);
						asSetSignal(0);
						
						wsBlinkAll(10);
						wsShow();
						speakerEnable(FALSE);
						
						printf("Turn off\r\n");
					} else if (mode == 1) {
						
						mode = 3;
						adcIndex = 0;
						
						speakerEnable(TRUE);
						asSetSignal(1);
						mp3SetVolume(mp3CmdQueue, &queueSize, 20);
						mp3Play(mp3CmdQueue, &queueSize, 1);
						delay(10000);
						asSetSignal(0);
						
						printf("Turn on\r\n");
					} else if (mode == 2 || mode == 3) {
						
						if (mode == 2) adcIndex = 0;
						wsUpdateMag();
						
						if (mode == 2) printf("Switch to Lighting Mode\r\n");
						else printf("Switch to Music Mode\r\n");
					}
				} else if (data_from_esp[1] == 0x02) {
					printf("Lighting Mode: \r\n");
					
					L_Type = data_from_esp[2];
					if (L_Type == 0x01) {
						Brightness = data_from_esp[3];
						slideValue = Brightness;
						
						for (i = 0; i < 3; i++) Color[i] = data_from_esp[i + 4];
						
					} else if (L_Type == 0x02) {
						setLedOffset(data_from_esp[3]);
					} else if (L_Type == 0x03) {
						zoomValue = data_from_esp[3];
					}
					wsUpdateMag();
				} else if (data_from_esp[1] == 0x03) {
					printf("Music Mode: \r\n");
					
					M_Type = data_from_esp[2];
					mLevel = data_from_esp[3];
					if (M_Type == 0x01) {
						for (i = 0; i < 3; i++) {
							if (mLevel == 0x01) high_color[i] = data_from_esp[i + 4];
							else if (mLevel == 0x02) mid_color[i] = data_from_esp[i + 4];
							else if (mLevel == 0x03) low_color[i] = data_from_esp[i + 4];
						}
						
						generateMusicColor(mLevel);
					} else if (M_Type == 0x02) {
						setLedOffset(data_from_esp[3]);
					} else if (M_Type == 0x04) {
						
					}
				} else if (data_from_esp[1] == 0x04) {
					printf("Setting: \r\n");
					sync = data_from_esp[2];
					
					if (sync == 0xFF) {
						for (i = 0; i <= 3; i++) time += (data_from_esp[6 - i] << (8 * i));
						Timestamp = time;
					}
					if (sync == 0x01 || sync == 0x00) {
						alarm.tm_hour = data_from_esp[4];
						alarm.tm_min = data_from_esp[5];
						alarm.tm_sec = data_from_esp[6];
						
						for (i = 0; i < 7; i++) {
							weekdayEN[6 - i] = (data_from_esp[3] >> i) & 0x01;
							printf("%d ", weekdayEN[6 - i]);
						}
						printf("\r\n");
						
						printf("Set Alarm %s => Days: %0X, %02d:%02d:%02d\r\n",
							(sync == 0x01) ? "On" : "Off",
							data_from_esp[3], 
							alarm.tm_hour, alarm.tm_min, alarm.tm_sec
						);
					}
					printf("Timestamp: %d sec\r\n", Timestamp);
				}
				
				for (i = 0; i < 9; i++) {
					printf("0x%02X ", data_from_esp[i]);
				}
				printf("checksum Correct!\r\n");
				
			} else {
				printf("checksum Error!\r\n");
//				printf("checksum = %04X\r\n", checksum);
//				printf("sum = %04X\r\n", sum);
				
			}
			espFlag = FALSE;
		}
		if (mBtAction == btClick) {
			static bool flag = TRUE;
			mBtAction = btNone;
			printf("click\r\n");
			
			if (mode == 2) mode = 3;
			else if (mode == 3) {
				mode = 2;
				adcIndex = 0;
			}
			if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
			
			wsUpdateMag();
		} else if (mBtAction == btLongClick) {
			mBtAction = btNone;
			printf("long click\r\n");
			
			if (mode != 0) {
				
				asSetSignal(1);
				mp3SetVolume(mp3CmdQueue, &queueSize, 20);
				mp3Play(mp3CmdQueue, &queueSize, 2);
				delay(10000);
				
				mode = 0;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-Off Message
				
				wsBlinkAll(10);
				wsShow();
				speakerEnable(FALSE);
				
				printf("off\r\n");
			} else {
				mode = 1;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-On Message
				delay(1000);
				mode = 3;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
				
				adcIndex = 0;
				
