Sway-Light/sway-light-ht32f52352/main.c
	for (color_rgb = 0; color_rgb < 3; color_rgb++) {
		if (level == 0x03) musicColor[0][color_rgb] = low_color[color_rgb];
		else if (level == 0x02) musicColor[4][color_rgb] = mid_color[color_rgb];
		else if (level == 0x01) musicColor[8][color_rgb] = high_color[color_rgb];
	}
	
	if (level == 0x03 || level == 0x02) calculateGradient(1, 3, low_color, mid_color);
	if (level == 0x01 || level == 0x02) calculateGradient(5, 7, mid_color, high_color);
	
//	for (color_level = 0; color_level < 9; color_level++) {
//		printf("musicColor[%2d]: ", color_level);
//		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
//			printf("%3d ", musicColor[color_level][color_rgb]);
//		}
//		printf("\r\n");
//	}
}

void DataToESP(u8 category, u8 type) {
	u8 i;
	u16 checksum = 0;
	
	data_to_esp[0] = 0x95; // Start Bit
	data_to_esp[1] = category;
	data_to_esp[2] = type;
	if (category == 0x01) {
		for (i = 3; i <= 6; i++) data_to_esp[i] = 0x00;
	} else if (category == 0x02) {
		if (type == 0x01) {
			data_to_esp[3] = slideValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = Color[i - 4];
		} else if (type == 0x03) {
			data_to_esp[3] = zoomValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = 0x00;
		}
	}
	for (i = 1; i <= 6; i++) checksum += data_to_esp[i];
	data_to_esp[7] = checksum >> 8;
	data_to_esp[8] = checksum & 0x00FF;
	data_to_esp[9] = 0x87; // End Bit
	
	printf("Sending: [");
	for (i = 0; i < 10; i++) printf("%02X ", data_to_esp[i]);
	printf("]\r\n");
	
	send_index = 0;
	toEspFlag = TRUE;
	USART_IntConfig(HT_USART0, USART_INT_TXDE, ENABLE);
}

static void delay(u32 count) {
	while (count--) {
		__NOP(); // Prevent delay loop be optimized
	}
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
